tutorials/MFM_BO_Tutorial/HF/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5.263878619;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(plate|hemisphere)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    tunnel
    {
        type  		slip;
    }

    symmetry
    {
        type 		symmetryPlane;
    }
}


// ************************************************************************* //
