tutorials/MFM_BO_Tutorial/HF/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   foam;
    fields          (U omega k nut);

    interpolationScheme cellPointFace;  //<- default

    surfaces
    {
        xNormal
        {
            type        cuttingPlane;
            point       (-0.28 0 0);
            normal      (0 1 0);
            //interpolate true;
        }
    }
}


// ************************************************************************* //
